{
  "<pad>": 0,
  "<unk>": 1,
  "de": 2,
  "en": 3,
  "pago": 4,
  "mxn": 5,
  "por": 6,
  "credito": 7,
  "pesos": 8,
  "tarjeta": 9,
  "debito": 10,
  "efectivo": 11,
  "con": 12,
  "cobro": 13,
  "compra": 14,
  "gasto": 15,
  "cargo": 16,
  "recibo": 17,
  "cliente": 18,
  "mercado": 19,
  "perro": 20,
  "nomina": 21,
  "regalo": 22,
  "bonificacion": 23,
  "sin": 24,
  "categoria": 25,
  "varios": 26,
  "otro": 27,
  "cancelacion": 28,
  "prestamo": 29,
  "devolucion": 30,
  "cashback": 31,
  "alimento": 32,
  "desconocido": 33,
  "reembolso": 34,
  "miscelaneo": 35,
  "bolsa": 36,
  "365": 37,
  "raya": 38,
  "amazon": 39,
  "consultoria": 40,
  "one": 41,
  "segunda": 42,
  "mano": 43,
  "freelance": 44,
  "honorarios": 45,
  "empresa": 46,
  "factura": 47,
  "22": 48,
  "12": 49,
  "trabajo": 50,
  "independiente": 51,
  "bono": 52,
  "plan": 53,
  "sueldo": 54,
  "estetica": 55,
  "salario": 56,
  "50": 57,
  "libre": 58,
  "15": 59,
  "consulta": 60,
  "mantenimiento": 61,
  "recibido": 62,
  "11": 63,
  "vendedor": 64,
  "dia": 65,
  "23": 66,
  "vacuna": 67,
  "quincena": 68,
  "43": 69,
  "mensualidad": 70,
  "san": 71,
  "40": 72,
  "26": 73,
  "dinero": 74,
  "29": 75,
  "17": 76,
  "28": 77,
  "14": 78,
  "31": 79,
  "25": 80,
  "48": 81,
  "premio": 82,
  "13": 83,
  "belleza": 84,
  "gas": 85,
  "proyecto": 86,
  "34": 87,
  "30": 88,
  "10": 89,
  "39": 90,
  "venta": 91,
  "44": 92,
  "16": 93,
  "farmacia": 94,
  "27": 95,
  "21": 96,
  "rendimiento": 97,
  "35": 98,
  "47": 99,
  "minimo": 100,
  "46": 101,
  "24": 102,
  "collar": 103,
  "abono": 104,
  "33": 105,
  "deposito": 106,
  "42": 107,
  "49": 108,
  "bitso": 109,
  "gbm": 110,
  "hipotecario": 111,
  "18": 112,
  "cetes": 113,
  "32": 114,
  "baby": 115,
  "shower": 116,
  "bano": 117,
  "paga": 118,
  "detalle": 119,
  "interes": 120,
  "reyes": 121,
  "croquetas": 122,
  "veterinaria": 123,
  "36": 124,
  "arena": 125,
  "gatos": 126,
  "cripto": 127,
  "adobe": 128,
  "41": 129,
  "office": 130,
  "att": 131,
  "financiera": 132,
  "apple": 133,
  "taller": 134,
  "prepa": 135,
  "valentin": 136,
  "bursanet": 137,
  "microsoft": 138,
  "suscripcion": 139,
  "personal": 140,
  "gato": 141,
  "45": 142,
  "propina": 143,
  "canina": 144,
  "38": 145,
  "manicure": 146,
  "kuspit": 147,
  "veterinario": 148,
  "boda": 149,
  "pet": 150,
  "shop": 151,
  "kueski": 152,
  "cetesdirecto": 153,
  "navidad": 154,
  "obsequio": 155,
  "37": 156,
  "19": 157,
  "chatgpt": 158,
  "plus": 159,
  "uber": 160,
  "petco": 161,
  "google": 162,
  "automotriz": 163,
  "icloud": 164,
  "binance": 165,
  "siapa": 166,
  "dividendo": 167,
  "vigilancia": 168,
  "aguinaldo": 169,
  "notion": 170,
  "minisplit": 171,
  "20": 172,
  "tianguis": 173,
  "anual": 174,
  "plomero": 175,
  "facial": 176,
  "chamarra": 177,
  "agua": 178,
  "internet": 179,
  "mensual": 180,
  "madres": 181,
  "cfe": 182,
  "boiler": 183,
  "movistar": 184,
  "peluqueria": 185,
  "la": 186,
  "comer": 187,
  "megacable": 188,
  "sally": 189,
  "beauty": 190,
  "issste": 191,
  "hipoteca": 192,
  "padre": 193,
  "lp": 194,
  "examen": 195,
  "masaje": 196,
  "dentista": 197,
  "salon": 198,
  "libro": 199,
  "pedicure": 200,
  "canva": 201,
  "pro": 202,
  "didi": 203,
  "shampoo": 204,
  "telmex": 205,
  "hospital": 206,
  "cuota": 207,
  "membresia": 208,
  "circle": 209,
  "suburbia": 210,
  "bodega": 211,
  "aurrera": 212,
  "maquillaje": 213,
  "ulta": 214,
  "gym": 215,
  "del": 216,
  "ahorro": 217,
  "doctor": 218,
  "psicologo": 219,
  "gasolina": 220,
  "ticketmaster": 221,
  "colegio": 222,
  "iave": 223,
  "colchon": 224,
  "cumpleanos": 225,
  "medico": 226,
  "imss": 227,
  "perfume": 228,
  "uniforme": 229,
  "escolar": 230,
  "costco": 231,
  "home": 232,
  "depot": 233,
  "electricista": 234,
  "receta": 235,
  "sky": 236,
  "telcel": 237,
  "medicina": 238,
  "central": 239,
  "abastos": 240,
  "tendejon": 241,
  "sudadera": 242,
  "renta": 243,
  "totalplay": 244,
  "recarga": 245,
  "ropa": 246,
  "levis": 247,
  "camisa": 248,
  "natural": 249,
  "coppel": 250,
  "barberia": 251,
  "seven": 252,
  "eleven": 253,
  "similares": 254,
  "mueble": 255,
  "mandado": 256,
  "matricula": 257,
  "elektra": 258,
  "benavides": 259,
  "netflix": 260,
  "nike": 261,
  "adidas": 262,
  "tenis": 263,
  "mochila": 264,
  "pintura": 265,
  "298": 266,
  "six": 267,
  "flags": 268,
  "caseta": 269,
  "cine": 270,
  "193": 271,
  "cantina": 272,
  "162": 273,
  "inscripcion": 274,
  "vestido": 275,
  "crema": 276,
  "heb": 277,
  "youtube": 278,
  "premium": 279,
  "sephora": 280,
  "volaris": 281,
  "spa": 282,
  "super": 283,
  "spotify": 284,
  "antojitos": 285,
  "concierto": 286,
  "unam": 287,
  "boleto": 288,
  "alquiler": 289,
  "70": 290,
  "medicamento": 291,
  "tamales": 292,
  "152": 293,
  "city": 294,
  "market": 295,
  "cerrajero": 296,
  "kinder": 297,
  "metrobus": 298,
  "papeleria": 299,
  "liverpool": 300,
  "balneario": 301,
  "hbo": 302,
  "luz": 303,
  "teatro": 304,
  "158": 305,
  "laboratorio": 306,
  "lentes": 307,
  "147": 308,
  "oxxo": 309,
  "133": 310,
  "pizza": 311,
  "depilacion": 312,
  "269": 313,
  "celular": 314,
  "abarrotes": 315,
  "xcaret": 316,
  "183": 317,
  "82": 318,
  "91": 319,
  "239": 320,
  "parking": 321,
  "taqueria": 322,
  "300": 323,
  "chedraui": 324,
  "escuela": 325,
  "pablo": 326,
  "clinica": 327,
  "75": 328,
  "127": 329,
  "167": 330,
  "lavadora": 331,
  "pantalon": 332,
  "tec": 333,
  "ado": 334,
  "216": 335,
  "playstation": 336,
  "225": 337,
  "izzi": 338,
  "65": 339,
  "218": 340,
  "cafe": 341,
  "mole": 342,
  "66": 343,
  "diplomado": 344,
  "cinepolis": 345,
  "277": 346,
  "zara": 347,
  "walmart": 348,
  "carnitas": 349,
  "254": 350,
  "disney": 351,
  "151": 352,
  "comedor": 353,
  "predial": 354,
  "refrigerador": 355,
  "antro": 356,
  "227": 357,
  "143": 358,
  "coursera": 359,
  "mudanza": 360,
  "cabify": 361,
  "87": 362,
  "110": 363,
  "252": 364,
  "parque": 365,
  "195": 366,
  "udg": 367,
  "museo": 368,
  "275": 369,
  "177": 370,
  "colegiatura": 371,
  "estacionamiento": 372,
  "213": 373,
  "playera": 374,
  "bar": 375,
  "146": 376,
  "89": 377,
  "61": 378,
  "peaje": 379,
  "telefono": 380,
  "iteso": 381,
  "zapatos": 382,
  "135": 383,
  "steam": 384,
  "fresko": 385,
  "161": 386,
  "eats": 387,
  "92": 388,
  "97": 389,
  "289": 390,
  "197": 391,
  "185": 392,
  "286": 393,
  "63": 394,
  "208": 395,
  "116": 396,
  "126": 397,
  "88": 398,
  "203": 399,
  "sam": 400,
  "club": 401,
  "228": 402,
  "starbucks": 403,
  "domicilio": 404,
  "141": 405,
  "puma": 406,
  "102": 407,
  "55": 408,
  "86": 409,
  "291": 410,
  "244": 411,
  "prime": 412,
  "172": 413,
  "rappi": 414,
  "ipn": 415,
  "295": 416,
  "132": 417,
  "hamburguesa": 418,
  "refaccion": 419,
  "flixbus": 420,
  "176": 421,
  "106": 422,
  "71": 423,
  "175": 424,
  "cafeteria": 425,
  "165": 426,
  "fonda": 427,
  "205": 428,
  "296": 429,
  "245": 430,
  "215": 431,
  "113": 432,
  "microbus": 433,
  "blusa": 434,
  "178": 435,
  "53": 436,
  "aguachile": 437,
  "tenencia": 438,
  "266": 439,
  "birria": 440,
  "barbacoa": 441,
  "camion": 442,
  "201": 443,
  "vuelo": 444,
  "69": 445,
  "combi": 446,
  "99": 447,
  "243": 448,
  "276": 449,
  "76": 450,
  "166": 451,
  "mexibus": 452,
  "154": 453,
  "263": 454,
  "pemex": 455,
  "103": 456,
  "238": 457,
  "247": 458,
  "186": 459,
  "294": 460,
  "chilaquiles": 461,
  "aeromexico": 462,
  "222": 463,
  "curso": 464,
  "107": 465,
  "68": 466,
  "57": 467,
  "134": 468,
  "soriana": 469,
  "nintendo": 470,
  "101": 471,
  "137": 472,
  "170": 473,
  "179": 474,
  "199": 475,
  "207": 476,
  "140": 477,
  "udemy": 478,
  "90": 479,
  "cinemex": 480,
  "despensa": 481,
  "tacos": 482,
  "supermercado": 483,
  "56": 484,
  "60": 485,
  "64": 486,
  "226": 487,
  "181": 488,
  "242": 489,
  "261": 490,
  "videojuego": 491,
  "mariscos": 492,
  "114": 493,
  "torta": 494,
  "280": 495,
  "73": 496,
  "cochinita": 497,
  "246": 498,
  "94": 499,
  "260": 500,
  "142": 501,
  "58": 502,
  "200": 503,
  "210": 504,
  "85": 505,
  "food": 506,
  "240": 507,
  "231": 508,
  "cena": 509,
  "117": 510,
  "93": 511,
  "283": 512,
  "258": 513,
  "198": 514,
  "taxi": 515,
  "81": 516,
  "tag": 517,
  "171": 518,
  "230": 519,
  "206": 520,
  "229": 521,
  "112": 522,
  "108": 523,
  "264": 524,
  "292": 525,
  "174": 526,
  "233": 527,
  "189": 528,
  "153": 529,
  "299": 530,
  "avion": 531,
  "214": 532,
  "150": 533,
  "51": 534,
  "211": 535,
  "256": 536,
  "zoologico": 537,
  "67": 538,
  "lonche": 539,
  "quesadilla": 540,
  "220": 541,
  "77": 542,
  "184": 543,
  "293": 544,
  "144": 545,
  "164": 546,
  "desayuno": 547,
  "148": 548,
  "191": 549,
  "204": 550,
  "almuerzo": 551,
  "72": 552,
  "249": 553,
  "192": 554,
  "universidad": 555,
  "121": 556,
  "136": 557,
  "235": 558,
  "100": 559,
  "219": 560,
  "129": 561,
  "115": 562,
  "285": 563,
  "221": 564,
  "123": 565,
  "202": 566,
  "metro": 567,
  "brunch": 568,
  "pozole": 569,
  "84": 570,
  "241": 571,
  "149": 572,
  "284": 573,
  "128": 574,
  "111": 575,
  "159": 576,
  "120": 577,
  "223": 578,
  "272": 579,
  "130": 580,
  "74": 581,
  "platzi": 582,
  "156": 583,
  "96": 584,
  "173": 585,
  "270": 586,
  "287": 587,
  "282": 588,
  "232": 589,
  "sushi": 590,
  "comida": 591,
  "105": 592,
  "169": 593,
  "274": 594,
  "125": 595,
  "verificacion": 596,
  "187": 597,
  "54": 598,
  "236": 599,
  "297": 600,
  "262": 601,
  "mecanico": 602,
  "290": 603,
  "253": 604,
  "209": 605,
  "95": 606,
  "52": 607,
  "273": 608,
  "267": 609,
  "138": 610,
  "257": 611,
  "248": 612,
  "62": 613,
  "281": 614,
  "98": 615,
  "279": 616,
  "217": 617,
  "118": 618,
  "157": 619,
  "271": 620,
  "80": 621,
  "288": 622,
  "122": 623,
  "109": 624,
  "250": 625,
  "188": 626,
  "restaurante": 627,
  "59": 628,
  "234": 629,
  "196": 630,
  "259": 631,
  "televia": 632,
  "190": 633,
  "237": 634,
  "163": 635,
  "251": 636,
  "124": 637,
  "145": 638,
  "773": 639,
  "119": 640,
  "78": 641,
  "83": 642,
  "224": 643,
  "684": 644,
  "155": 645,
  "268": 646,
  "265": 647,
  "1398": 648,
  "745": 649,
  "79": 650,
  "1191": 651,
  "160": 652,
  "104": 653,
  "824": 654,
  "359": 655,
  "1301": 656,
  "278": 657,
  "194": 658,
  "1029": 659,
  "180": 660,
  "139": 661,
  "412": 662,
  "182": 663,
  "638": 664,
  "1066": 665,
  "583": 666,
  "1134": 667,
  "1426": 668,
  "346": 669,
  "377": 670,
  "744": 671,
  "925": 672,
  "482": 673,
  "693": 674,
  "479": 675,
  "337": 676,
  "212": 677,
  "131": 678,
  "1374": 679,
  "1326": 680,
  "505": 681,
  "612": 682,
  "1055": 683,
  "902": 684,
  "313": 685,
  "826": 686,
  "558": 687,
  "766": 688,
  "501": 689,
  "1080": 690,
  "1306": 691,
  "255": 692,
  "392": 693,
  "399": 694,
  "978": 695,
  "1115": 696,
  "931": 697,
  "701": 698,
  "168": 699,
  "672": 700,
  "730": 701,
  "866": 702,
  "1211": 703,
  "585": 704,
  "1357": 705,
  "781": 706,
  "832": 707,
  "1194": 708,
  "1303": 709,
  "1185": 710,
  "1040": 711,
  "935": 712,
  "516": 713,
  "986": 714,
  "586": 715,
  "776": 716,
  "1166": 717,
  "1133": 718,
  "1282": 719,
  "1287": 720,
  "1436": 721,
  "636": 722,
  "919": 723,
  "658": 724,
  "842": 725,
  "1371": 726,
  "1128": 727,
  "534": 728,
  "1472": 729,
  "1281": 730,
  "1193": 731,
  "414": 732,
  "468": 733,
  "946": 734,
  "562": 735,
  "1376": 736,
  "354": 737,
  "566": 738,
  "1168": 739,
  "682": 740,
  "550": 741,
  "810": 742,
  "1279": 743,
  "1440": 744,
  "659": 745,
  "1328": 746,
  "969": 747,
  "900": 748,
  "639": 749,
  "912": 750,
  "709": 751,
  "856": 752,
  "1469": 753,
  "720": 754,
  "813": 755,
  "1004": 756,
  "1331": 757,
  "1271": 758,
  "424": 759,
  "777": 760,
  "883": 761,
  "1274": 762,
  "601": 763,
  "549": 764,
  "9225": 765,
  "2968": 766,
  "597": 767,
  "2407": 768,
  "356": 769,
  "913": 770,
  "372": 771,
  "1035": 772,
  "1237": 773,
  "1224": 774,
  "1347": 775,
  "1000": 776,
  "456": 777,
  "761": 778,
  "729": 779,
  "847": 780,
  "520": 781,
  "984": 782,
  "1217": 783,
  "630": 784,
  "940": 785,
  "1215": 786,
  "1175": 787,
  "765": 788,
  "796": 789,
  "410": 790,
  "981": 791,
  "609": 792,
  "547": 793,
  "324": 794,
  "1257": 795,
  "1446": 796,
  "512": 797,
  "1245": 798,
  "1056": 799,
  "509": 800,
  "1173": 801,
  "347": 802,
  "892": 803,
  "1359": 804,
  "1123": 805,
  "1324": 806,
  "962": 807,
  "598": 808,
  "4015": 809,
  "916": 810,
  "848": 811,
  "353": 812,
  "1479": 813,
  "1399": 814,
  "870": 815,
  "1405": 816,
  "966": 817,
  "1453": 818,
  "428": 819,
  "6424": 820,
  "716": 821,
  "1112": 822,
  "797": 823,
  "542": 824,
  "755": 825,
  "648": 826,
  "1319": 827,
  "333": 828,
  "1268": 829,
  "618": 830,
  "403": 831,
  "323": 832,
  "839": 833,
  "626": 834,
  "757": 835,
  "1500": 836,
  "930": 837,
  "1057": 838,
  "951": 839,
  "2761": 840,
  "1177": 841,
  "462": 842,
  "518": 843,
  "899": 844,
  "922": 845,
  "1073": 846,
  "1219": 847,
  "758": 848,
  "722": 849,
  "1151": 850,
  "1317": 851,
  "1086": 852,
  "2889": 853,
  "502": 854,
  "1209": 855,
  "849": 856,
  "545": 857,
  "326": 858,
  "610": 859,
  "6817": 860,
  "541": 861,
  "915": 862,
  "2352": 863,
  "964": 864,
  "1053": 865,
  "600": 866,
  "374": 867,
  "1083": 868,
  "676": 869,
  "1368": 870,
  "616": 871,
  "1336": 872,
  "1182": 873,
  "525": 874,
  "533": 875,
  "437": 876,
  "411": 877,
  "3177": 878,
  "1280": 879,
  "1205": 880,
  "666": 881,
  "1447": 882,
  "1444": 883,
  "837": 884,
  "1102": 885,
  "381": 886,
  "1081": 887,
  "1113": 888,
  "1477": 889,
  "855": 890,
  "1428": 891,
  "351": 892,
  "2245": 893,
  "1252": 894,
  "394": 895,
  "743": 896,
  "898": 897,
  "905": 898,
  "1277": 899,
  "1038": 900,
  "800": 901,
  "467": 902,
  "4819": 903,
  "998": 904,
  "1096": 905,
  "360": 906,
  "721": 907,
  "747": 908,
  "1108": 909,
  "421": 910,
  "1239": 911,
  "332": 912,
  "1408": 913,
  "395": 914,
  "835": 915,
  "950": 916,
  "6814": 917,
  "858": 918,
  "1476": 919,
  "474": 920,
  "1164": 921,
  "759": 922,
  "8667": 923,
  "949": 924,
  "1295": 925,
  "620": 926,
  "1315": 927,
  "828": 928,
  "706": 929,
  "1442": 930,
  "471": 931,
  "742": 932,
  "397": 933,
  "602": 934,
  "831": 935,
  "561": 936,
  "802": 937,
  "1023": 938,
  "8193": 939,
  "976": 940,
  "5378": 941,
  "945": 942,
  "932": 943,
  "1158": 944,
  "1179": 945,
  "3748": 946,
  "1145": 947,
  "923": 948,
  "431": 949,
  "1302": 950,
  "7631": 951,
  "947": 952,
  "1406": 953,
  "660": 954,
  "1049": 955,
  "580": 956,
  "420": 957,
  "1062": 958,
  "918": 959,
  "1385": 960,
  "443": 961,
  "985": 962,
  "7613": 963,
  "664": 964,
  "772": 965,
  "657": 966,
  "473": 967,
  "934": 968,
  "1407": 969,
  "1087": 970,
  "9754": 971,
  "1325": 972,
  "367": 973,
  "1409": 974,
  "645": 975,
  "1443": 976,
  "891": 977,
  "458": 978,
  "948": 979,
  "427": 980,
  "687": 981,
  "1349": 982,
  "1435": 983,
  "788": 984,
  "1127": 985,
  "882": 986,
  "724": 987,
  "1114": 988,
  "1138": 989,
  "341": 990,
  "1275": 991,
  "1377": 992,
  "786": 993,
  "1272": 994,
  "504": 995,
  "1213": 996,
  "485": 997,
  "1465": 998,
  "1119": 999,
  "634": 1000,
  "1024": 1001,
  "1019": 1002,
  "513": 1003,
  "529": 1004,
  "1459": 1005,
  "5506": 1006,
  "1130": 1007,
  "779": 1008,
  "994": 1009,
  "857": 1010,
  "508": 1011,
  "731": 1012,
  "859": 1013,
  "644": 1014,
  "1155": 1015,
  "995": 1016,
  "7520": 1017,
  "943": 1018,
  "1184": 1019,
  "1475": 1020,
  "1292": 1021,
  "1125": 1022,
  "663": 1023,
  "1110": 1024,
  "1342": 1025,
  "416": 1026,
  "1147": 1027,
  "321": 1028,
  "787": 1029,
  "450": 1030,
  "432": 1031,
  "1483": 1032,
  "500": 1033,
  "958": 1034,
  "1480": 1035,
  "1221": 1036,
  "469": 1037
}